{
    "hero_name": "Jasmina Muharemovic",
    "hero_role": "Fullstack Entwicklerin",
    "hero_content": "Ich bin eine Fullstack-Entwicklerin mit fundierter Erfahrung in der Frontend- und Backend-Entwicklung. Zu meinen Stärken zählen die Erstellung von REST-APIs mit Kotlin und Spring Boot sowie die Entwicklung von Frontend-Lösungen mit React.js und JavaScript. Zusätzlich zu meiner Arbeit mit modernen Webtechnologien habe ich erste Erfahrungen mit Docker und Kubernetes gesammelt. Ich spreche fließend Kroatisch, Deutsch und Englisch und schätze die Arbeit in multikulturellen Teams. Derzeit konzentriere ich mich darauf, innovative und skalierbare Anwendungen zu entwickeln, die den Bedürfnissen der Nutzer gerecht werden. Geboren in Berlin, mit bosnischen Wurzeln und kroatischer Staatsbürgerschaft, lebe ich seit acht Jahren wieder in Deutschland. Diese internationale Perspektive prägt meine Herangehensweise und fördert kreatives, lösungsorientiertes Arbeiten.",
    "about_title": "Über",
    "about_me": "mich",
    "about_img_alt": "Jasmina Muharemovic profil Bild",
    "about_text": "Ich habe meine Karriere als Fullstack-Trainee begonnen und konnte in dieser Zeit wertvolle Erfahrungen mit Technologien wie Kotlin, Spring Boot, React.js und Docker sammeln. Später arbeitete ich im Bereich SAP Security Management, wo ich erste Einblicke in die Arbeit mit Angular sowie eine intensive Beschäftigung mit Datenbanken gewann. Zudem habe ich grundlegende Kenntnisse in Java und C#. Meine berufliche Reise hat mich mit zahlreichen Tools und Technologien vertraut gemacht, darunter Git und Azure DevOps. Besonders reizt mich die Arbeit an Frontend- und Fullstack-Projekten, bei denen ich meine vielseitigen Erfahrungen einbringe, um nutzerzentrierte, skalierbare Lösungen zu entwickeln. Zudem habe ich ein ausgeprägtes Auge für Design und achte stets darauf, dass die Benutzeroberflächen nicht nur funktional, sondern auch ästhetisch ansprechend sind. Ich bin ein hilfsbereiter Kollege, der gerne Unterstützung bietet und die Zusammenarbeit im Team schätzt. Wenn ich nicht programmiere, informiere ich mich regelmäßig über die neuesten Technologietrends, nehme an Vorlesungen teil und spiele gerne Fußball oder Schach.",
    "language_tooltip": "Sprache ändern",
    "experience": {
        "experience": "Erfahrung",
        "experiences": [
            {
                "year": "07/2023 - 02/2024",
                "role": "Security Application Developer",
                "company": "Asconsit GmbH, Lüneburg",
                "description": "Ich arbeitete im Bereich SAP Security Management, verwaltete SQL-Datenbanken und sorgte für die Systemintegrität. Zudem trug ich zur Entwicklung eines SAP-Frontends mit Angular bei und half dabei, effiziente und benutzerfreundliche Anwendungen zu erstellen.",
                "technologies": [
                    "SAP-Security-Management",
                    "SQL",
                    "Angular",
                    "JavaScript"
                ]
            },
            {
                "year": "05/2021 - 11/2022",
                "role": "Praktikantin in der Fullstack Webanwendungsentwicklung",
                "company": "Novatec GmbH, Berlin",
                "description": "Als Fullstack-Trainee entwickelte ich REST-API-Anwendungen mit Spring Boot, Kotlin und React.js. Dabei habe ich an zwei Projekten mitgearbeitet: Einem Microservice in Spring Boot, bei dem ich vor allem mit React gearbeitet habe, und einem Performance-Tool, bei dem ebenfalls React im Vordergrund stand.",
                "technologies": [
                    "Kotlin",
                    "SpringBoot",
                    "ReactJS",
                    "Docker",
                    "Git"
                ]
            },
            {
                "year": "05/2019 - 08/2019",
                "role": "Kellnerin",
                "company": "Stern und Kreisschiffahrt GmbH, Berlin",
                "description": "Ich arbeitete als Kellnerin, zunächst in Vollzeit, um mich finanziell vorzubereiten, und später in Teilzeit (Minijob), während ich meine Karriere als Entwicklerin verfolgte.",
                "technologies": [
                    "Kommunikation",
                    "Arbeitsmoral",
                    "Geduld",
                    "Anpassungsfähigkeit"
                ]
            },
            {
                "year": "01/2019 - 04/2019",
                "role": "Commis de Rang (Kellnerin/Kellner)",
                "company": "Das Kranzbach Hotel ****s, Krün (Bayern)",
                "description": "Ich bot herausragenden Kundenservice in einem gehobenen Hotelrestaurant, stellte die Zufriedenheit der Gäste sicher und sorgte für einen reibungslosen Ablauf der gastronomischen Erfahrungen.",
                "technologies": [
                    "Kommunikation",
                    "Arbeitsmoral",
                    "Geduld",
                    "Anpassungsfähigkeit"
                ]
            }
        ]
    },
    "projects_title": "Projekte",
    "projects": {
        "quarkus_project": {
            "title": "Schulverwaltungssystem",
            "description": "Das Schulverwaltungssystem ist ein Quarkus-basiertes Backend mit PostgreSQL, das Teilnehmer und Schulungen verwaltet. Es ermöglicht es Nutzern, Teilnehmer über RESTful-Endpunkte in bestimmte Kurse einzutragen und vereinfacht so das Teilnehmer- und Kursmanagement.",
            "image": "/assets/projects/project-1.avif",
            "technologies": [
                "Quarkus",
                "Kotlin",
                "PostgreSQL",
                "Docker",
                "VueJS"
            ]
        },
        "pwa_application": {
            "title": "PWA-Anwendung",
            "description": "Eine einfache, leichte App mit einem Header und einer Navigationsleiste. Sie bietet Offline-Funktionalität, sodass Benutzer die App herunterladen und ohne aktive Internetverbindung verwenden können, was eine reibungslose Nutzung auch ohne Internetzugang ermöglicht. Die App ist sowohl für mobile Geräte als auch für Desktops responsiv, sodass sie auf verschiedenen Bildschirmgrößen optimal funktioniert.",
            "image": "/assets/projects/project-2.avif",
            "technologies": [
                "HTML",
                "JavaScript",
                "Service Workers",
                "Web App Manifest"
            ]
        },
        "trafic_light_control": {
            "title": "Ampelsteuerung",
            "description": "Ein Ampelsteuerungssystem mit Java und JPanel, das drei Fahrzeugampeln und zwei Fußgängerampeln umfasst.",
            "image": "/assets/projects/project-3.avif",
            "technologies": [
                "Java",
                "JPanel",
                "JFrame",
                "Runnable"
            ]
        },
        "responsive_layout": {
            "title": "Responsives Layout",
            "description": "Das Responsives Layout-Projekt war die abschließende Herausforderung einer 21-tägigen Herausforderung von Kevin Powell, die sich auf das Beherrschen von responsiven Designs konzentrierte. Es demonstriert die erlernten Fähigkeiten und Techniken und sorgt dafür, dass sich das Layout nahtlos an verschiedene Bildschirmgrößen und Geräte anpasst.",
            "image": "/assets/projects/project-4.avif",
            "technologies": [
                "HTML",
                "CSS",
                "CSS-Media Queries",
                "CSS-Flexbox",
                "CSS-Grid"
            ]
        }
    },
    "contact": {
        "get_in_touch": "Kontaktieren Sie mich :)",
        "address": "Vor dem Neuen Tore, Lüneburg",
        "phone_no": "00491724732204",
        "email": "jasminamhrmvc@proton.me"
    },
    "technologies_title": "Technologien",
    "technologies": {
        "React.js": "React.js",
        "Kotlin": "Kotlin",
        "Spring Boot": "Spring Boot",
        "Docker": "Docker",
        "PostgreSQL": "PostgreSQL",
        "JavaScript": "JavaScript",
        "Azure DevOps": "Azure DevOps"
    },
    "powered_by_react": "Angetrieben von React"
}
