{
    "hero_name": "Jasmina Muharemovic",
    "hero_role": "Fullstack Developer",
    "hero_content": "I am a Fullstack Developer with solid experience in both frontend and backend development. My strengths include creating REST APIs using Kotlin and Spring Boot, as well as developing frontend solutions with React.js and JavaScript. In addition to working with modern web technologies, I have gained initial experience with Docker and Kubernetes. I am fluent in Croatian, German, and English, and I value working in multicultural teams. Currently, I am focused on developing innovative and scalable applications that meet user needs. Born in Berlin, with Bosnian roots and Croatian citizenship, I have been living in Germany again for eight years. This international perspective shapes my approach and encourages creative, solution-oriented work.",
    "about_title": "About",
    "about_me": "me",
    "about_img_alt": "Jasmina Muharemovic profile picture",
    "about_text": "I started my career as a Fullstack trainee, gaining valuable experience with technologies like Kotlin, Spring Boot, React.js, and Docker. Later, I worked in SAP Security Management, where I gained initial insights into working with Angular and became deeply involved with databases. Additionally, I have basic knowledge of Java and C#. My professional journey has made me familiar with numerous tools and technologies, including Git and Azure DevOps. I am particularly interested in working on frontend and fullstack projects, where I can leverage my diverse experience to develop user-centric, scalable solutions. I also have a keen eye for design and always ensure that the user interfaces are not only functional but also visually appealing. I am a helpful colleague who enjoys offering support and values teamwork. When I'm not coding, I stay updated on the latest tech trends, attend lectures, and enjoy playing football or chess.",
    "language_tooltip": "Change language",
    "experience": {
        "experience": "Experience",
        "experiences": [
            {
                "year": "07/2023 - 02/2024",
                "role": "Security Application Developer",
                "company": "Asconsit GmbH, Lüneburg",
                "description": "I worked in SAP Security Management, managing SQL databases and ensuring system integrity. Additionally, I contributed to the development of an SAP frontend using Angular and helped create efficient and user-friendly applications.",
                "technologies": [
                    "SAP Security Management",
                    "SQL",
                    "Angular",
                    "JavaScript"
                ]
            },
            {
                "year": "05/2021 - 11/2022",
                "role": "Fullstack Web Application Development Intern",
                "company": "Novatec GmbH, Berlin",
                "description": "As a Fullstack trainee, I developed REST API applications using Spring Boot, Kotlin, and React.js. I worked on two projects: A microservice in Spring Boot, where I primarily worked with React, and a performance tool that also focused on React.",
                "technologies": [
                    "Kotlin",
                    "Spring Boot",
                    "React.js",
                    "Docker",
                    "Git"
                ]
            },
            {
                "year": "05/2019 - 08/2019",
                "role": "Waitress",
                "company": "Stern und Kreisschiffahrt GmbH, Berlin",
                "description": "I worked as a waitress, initially full-time to prepare financially, and later part-time (minijob) while pursuing my career as a developer.",
                "technologies": [
                    "Communication",
                    "Work Ethic",
                    "Patience",
                    "Adaptability"
                ]
            },
            {
                "year": "01/2019 - 04/2019",
                "role": "Commis de Rang (Waiter/Waitress)",
                "company": "Das Kranzbach Hotel ****s, Krün (Bavaria)",
                "description": "I provided excellent customer service in a fine-dining hotel restaurant, ensuring guest satisfaction and smooth operations throughout the dining experience.",
                "technologies": [
                    "Communication",
                    "Work Ethic",
                    "Patience",
                    "Adaptability"
                ]
            }
        ]
    },
    "projects_title": "Projects",
    "projects": {
        "quarkus_project": {
            "title": "School Management System",
            "description": "The School Management System is a Quarkus-based backend with PostgreSQL that manages participants and training courses. It allows users to register participants for specific courses via RESTful endpoints, streamlining participant and course management.",
            "image": "/assets/projects/project-1.avif",
            "technologies": [
                "Quarkus",
                "Kotlin",
                "PostgreSQL",
                "Docker",
                "Vue.js"
            ]
        },
        "pwa_application": {
            "title": "PWA Application",
            "description": "A simple, lightweight app with a header and navigation bar. It offers offline functionality, allowing users to download and use the app without an active internet connection. The app is responsive, making it suitable for mobile devices and desktops, adjusting to various screen sizes.",
            "image": "/assets/projects/project-2.avif",
            "technologies": [
                "HTML",
                "JavaScript",
                "Service Workers",
                "Web App Manifest"
            ]
        },
        "trafic_light_control": {
            "title": "Traffic Light Control",
            "description": "A traffic light control system using Java and JPanel, featuring three vehicle traffic lights and two pedestrian traffic lights.",
            "image": "/assets/projects/project-3.avif",
            "technologies": [
                "Java",
                "JPanel",
                "JFrame",
                "Runnable"
            ]
        },
        "responsive_layout": {
            "title": "Responsive Layout",
            "description": "The Responsive Layout project was the final challenge of a 21-day challenge from Kevin Powell, focusing on mastering responsive designs. It demonstrates the skills and techniques learned and ensures the layout adapts seamlessly to different screen sizes and devices.",
            "image": "/assets/projects/project-4.avif",
            "technologies": [
                "HTML",
                "CSS",
                "CSS Media Queries",
                "CSS Flexbox",
                "CSS Grid"
            ]
        }
    },
    "contact": {
        "get_in_touch": "Get in touch :)",
        "address": "Vor dem Neuen Tore, Lüneburg",
        "phone_no": "00491724732204",
        "email": "jasminamhrmvc@proton.me"
    },
    "technologies_title": "Technologies",
    "technologies": {
        "SAP-Security-Management": "SAP Security Management",
        "SQL": "SQL",
        "Angular": "Angular",
        "JavaScript": "JavaScript",
        "Kotlin": "Kotlin",
        "Spring-Boot": "Spring Boot",
        "React.js": "React.js",
        "Docker": "Docker",
        "Git": "Git",
        "Communication": "Communication",
        "Work Ethic": "Work Ethic",
        "Patience": "Patience",
        "Adaptability": "Adaptability",
        "HTML": "HTML",
        "CSS": "CSS",
        "Node.js": "Node.js",
        "MongoDB": "MongoDB",
        "Firebase": "Firebase",
        "Bootstrap": "Bootstrap",
        "Vue.js": "Vue.js",
        "Express": "Express",
        "mySQL": "mySQL"
    },
    "powered_by_react": "Powered by React"
}
